Revit 2027 API
PhaseFilter.SetPhaseStatusPresentation Method
 Sets the phase status presentation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPhaseStatusPresentation(
	ElementOnPhaseStatus status,
	PhaseStatusPresentation presentation
)
Public Sub SetPhaseStatusPresentation (
	status As ElementOnPhaseStatus,
	presentation As PhaseStatusPresentation
)
public:
void SetPhaseStatusPresentation(
	ElementOnPhaseStatus status,
	PhaseStatusPresentation presentation
)
member SetPhaseStatusPresentation :
        status : ElementOnPhaseStatus *
        presentation : PhaseStatusPresentation -> unit
Parameters
status ElementOnPhaseStatus
 The element phase status.
presentation PhaseStatusPresentation
 The phase status presentation.
Exceptions
Exception | Condition
ArgumentException |  status is invalid for presentation query.
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PhaseFilter Class
Autodesk.Revit.DB Namespace